# Selecting and Creating Columns
Import libraries

In [2]:
import pandas as pd

Import Data

In [3]:
df = pd.read_csv('athlete_events.csv')

## Selecting Columns
Selecting a single column will return a Series

In [4]:
df['Name'].head()

0                   A Dijiang
1                    A Lamusi
2         Gunnar Nielsen Aaby
3        Edgar Lindenau Aabye
4    Christine Jacoba Aaftink
Name: Name, dtype: object

To select multiple columns, we need to put them in a single list

In [5]:
df[['Name', 'Sex', 'Age', 'Team']].head()

                       Name Sex   Age            Team
0                 A Dijiang   M  24.0           China
1                  A Lamusi   M  23.0           China
2       Gunnar Nielsen Aaby   M  24.0         Denmark
3      Edgar Lindenau Aabye   M  34.0  Denmark/Sweden
4  Christine Jacoba Aaftink   F  21.0     Netherlands

## Basic Operations on Column Values

In [13]:
df['Age'].head()

ID
1    24.0
2    23.0
3    24.0
4    34.0
5    21.0
Name: Age, dtype: float64

### Addition

In [16]:
df['Age'].head()+100

ID
1    124.0
2    123.0
3    124.0
4    134.0
5    121.0
Name: Age, dtype: float64

In [17]:
df['Age'].add(100).head()

ID
1    124.0
2    123.0
3    124.0
4    134.0
5    121.0
Name: Age, dtype: float64

### Subtraction

In [18]:
df['Age'].head()-50

ID
1   -26.0
2   -27.0
3   -26.0
4   -16.0
5   -29.0
Name: Age, dtype: float64

In [19]:
df['Age'].sub(50).head()

ID
1   -26.0
2   -27.0
3   -26.0
4   -16.0
5   -29.0
Name: Age, dtype: float64

### Multiplication

In [20]:
df['Age'].head()*10

ID
1    240.0
2    230.0
3    240.0
4    340.0
5    210.0
Name: Age, dtype: float64

In [22]:
df['Age'].mul(10).head()

ID
1    240.0
2    230.0
3    240.0
4    340.0
5    210.0
Name: Age, dtype: float64

### Division

In [25]:
df['Age'].head()/10

ID
1    2.4
2    2.3
3    2.4
4    3.4
5    2.1
Name: Age, dtype: float64

In [27]:
df['Age'].div(10).head()

ID
1    2.4
2    2.3
3    2.4
4    3.4
5    2.1
Name: Age, dtype: float64

### Modulu (calculate remainder)

In [28]:
df['Age'].head()%10

ID
1    4.0
2    3.0
3    4.0
4    4.0
5    1.0
Name: Age, dtype: float64

In [30]:
df['Age'].mod(10).head()

ID
1    4.0
2    3.0
3    4.0
4    4.0
5    1.0
Name: Age, dtype: float64

## Adding & Removing Columns
Selecting a nonexistent column name will return a key error

In [2]:
df['BMI'] # Error!

Assigning a value to a nonexistent column, on the other hand, will generate it and add it to the dataframe permanantly. Columns generated in this manner would always be added on the far right

In [24]:
df['BMI'] = df['Weight'] / (df['Height'] / 100) ** 2
df.head()

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,BMI
ID,,,,,,,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,24.691358
2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,20.761246
3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,NaN
4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,NaN
5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,23.959094

### insert
We can use the ***insert*** method to specify the position of our new column

In [36]:
df.insert(6, 'Weight in Pounds', df['Weight'] * 2.2)
df.head()

,Name,Sex,Age,Height,Weight,Team,Weight in Pounds,NOC,Games,Year,Season,City,Sport,Event,Medal,BMI
ID,,,,,,,,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,176.0,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,24.691358
2,A Lamusi,M,23.0,170.0,60.0,China,132.0,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,20.761246
3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,NaN,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,NaN
4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,NaN,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,NaN
5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,180.4,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,23.959094

### drop
If we want to delete new column we can specift that using drop. We also need to specify axis=1 because we can use drop to remove rows as well and that's the default

In [37]:
df.drop('Weight in Pounds', axis=1).head()

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,BMI
ID,,,,,,,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,24.691358
2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,20.761246
3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,NaN
4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,NaN
5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,23.959094

We can drop an entire list of columns at once

In [45]:
df.drop(['Games', 'Year', 'Season','Medal', 'City','Sport'], axis=1).head()

,Name,Sex,Age,Height,Weight,Team,NOC,Event,BMI
ID,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,CHN,Basketball Men's Basketball,24.691358
2,A Lamusi,M,23.0,170.0,60.0,China,CHN,Judo Men's Extra-Lightweight,20.761246
3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,Football Men's Football,NaN
4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,Tug-Of-War Men's Tug-Of-War,NaN
5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,Speed Skating Women's 500 metres,23.959094

### inplace
The change of the dataframe won't stick unless we use the ***inplace*** parameter

In [38]:
df.head(3)

,Name,Sex,Age,Height,Weight,Team,Weight in Pounds,NOC,Games,Year,Season,City,Sport,Event,Medal,BMI
ID,,,,,,,,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,176.0,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,24.691358
2,A Lamusi,M,23.0,170.0,60.0,China,132.0,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,20.761246
3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,NaN,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,NaN

In [39]:
df.drop('Weight in Pounds', axis=1, inplace=True)
df.head(3)

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,BMI
ID,,,,,,,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,24.691358
2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,20.761246
3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,NaN

We can delete rows in the same manner

In [40]:
df.drop(1).head(3)

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,BMI
ID,,,,,,,,,,,,,,,
2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,20.761246
3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,NaN
4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,NaN

# Displaying Distinct Values 
We can create a list of unique values (without duplicates) from any column using the **unique** method

In [15]:
df['Season'].unique()

array(['Summer', 'Winter'], dtype=object)

In [21]:
df['Medal'].unique()

array([nan, 'Gold', 'Bronze', 'Silver'], dtype=object)

### nunique()
**nunique** returns the ***number*** of the unique values (not including missing values)

In [16]:
df['Season'].nunique()

2

In [22]:
df['Medal'].nunique()

3

In [23]:
df['Medal'].nunique(dropna=False)

4